{
    "data":[
        {
            "id":0,
            "avator":"imgs/UI/childMenu/gameboy",
            "gift": 1,
            "papper":1,
            "ribbon":1,
            "pattern":2,
            "description":[
                "哈喽圣诞老人！\n我非常喜欢看YouTube，上面有很多超级搞笑的视频，还有好～多厉害的人！\n我最喜欢游戏类视频！\n游戏主播都又酷又搞笑，我以后也想成为一个很厉害的游戏主播！\n你能帮助我实现这个愿望吗？拜托拜托～",
                "Hello Santa! \nI really like watching YouTube, there are so many super funny videos and so many awesome people! \nI like video games best! \nGame anchors are cool and funny. I also want to be a very powerful game anchor in the future! \nCan you help me make this wish come true? please ~"
            ]
        },
        {
            "id":1,
            "avator":"imgs/UI/childMenu/socks",
            "gift": 2,
            "papper":0,
            "ribbon":1,
            "pattern":1,
            "description":[
                "圣诞老人你好，\n我特别喜欢Ele-Girls，她们是一个超级无敌酷的偶像组合。\n我在每个社交媒体上都粉了她们，还加入了头号粉丝团，认识了我最好的朋友米拉，\n但是最近米拉对我很冷淡，因为我没有买Ele-Girls的联名系列，可是那些周边都太贵了，凭零花钱根本买不起，\n我不想让她继续生我的气，你可以帮我吗？",
                "Santa Claus, hello! \nI really love Ele-Girls. They are an incredibly cool idol group. \nI've followed them on every social media platform and joined their top fan club, where I met my best friend Mira. \nBut recently, Mira has been cold to me because I didn't buy Ele-Girls' collaboration series. \nBut those peripherals are too expensive, and I can't afford them on my pocket money. \nI don't want her to be angry with me anymore. Can you help me?"
            ]
        },
        {
            "id":2,
            "avator":"imgs/UI/childMenu/medicine",
            "gift": 3,
            "papper":2,
            "ribbon":2,
            "pattern":0,
            "description":[
                "圣诞老人，您好，\n我是一名12岁的小学生，最近面临升学，压力很大，\n妈妈怕我学习累着，总是炖鸡、烧鱼汤给我补身体，\n她希望我可以上进，考进市里最好的初中，\n但我的头总是昏昏沉沉的，也没有精神，我很害怕自己会失败，伤妈妈的心，\n有没有什么礼物可以帮我提高精神吗？",
                "Santa Claus, hello. \nI'm a 12-year-old elementary school student, \nand I've been under a lot of pressure lately with the upcoming school entrance exams. \nMy mom is afraid that I'll get tired from studying, \nso she always stews chicken and makes fish soup to nourish me. \nShe hopes I can strive for excellence and get into the best junior high school in the city. \nBut my head is always foggy, and I lack energy. \nI'm scared that I might fail and disappoint my mom. \nIs there any gift that can help boost my spirits?"
            ]
        },
        {
            "id":3,
            "avator":"imgs/UI/childMenu/catgirl",
            "gift": 4,
            "papper":0,
            "ribbon":2,
            "pattern":3,
            "description":[
                "嗨！圣诞老人，\n这里是Necomi！\n呼呼~~没想到当红的Tiktok Coser也会幼稚到给圣诞老人寄信吧？\n别问人家的年龄，人家是永远的八岁啦！\n就算是您也肯定刷到过我的视频吧？\n您一年三百六十四天都待在家里，不刷Tiktok还能干嘛呢？\n总之人家想要可爱的东西呀，想要对着镜头大声喊：\n“哇，圣诞老人送给我礼物了！说明人家今年也是个乖女孩！”\n可以满足我这个小~小~的心愿吗？哎嘿嘿~~",
                "Hi there, Santa! \nIt's Necomi here! \nHoo hoo~~ Didn't expect a popular TikTok Coser to be childish enough to send a letter to Santa, did you? \nDon't ask about my age; I'm eternally eight years old! \nEven you must have come across my videos, right? \nWith 364 days a year at home, what else would you do but scroll through TikTok? \nAnyway, I want something cute, so I can shout in front of the camera, \n\"Wow, Santa brought me a gift! That means I've been a good girl this year!\" \nCan you fulfill this tiny little wish of mine? Hehe~"
            ]
        },
        {
            "id":4,
            "avator":"imgs/UI/childMenu/mysterybox",
            "gift": 5,
            "papper":2,
            "ribbon":1,
            "pattern":1,
            "description":[
                "嗨，圣诞老人，\n我听说每一个充满童心的人，都可以收到圣诞老人的礼物，\n这话放在一个二十五岁的上班族身上也适用！\n总之，我是那种比起礼物本身，更享受拆礼物过程的人，\n那种期待感抓得我心直痒痒！你能给我一个大大惊喜吗？",
                "Hi there, Santa! \nI've heard that anyone with a childlike heart can receive gifts from Santa, \nand that applies to a 25-year-old office worker too! \nAnyway, I'm the kind of person who enjoys the process of unwrapping gifts more than the gifts themselves; \nthat sense of anticipation just tickles my heart! \nCan you give me a big surprise?"
            ]
        },
        {
            "id":5,
            "avator":"imgs/UI/childMenu/tedybear",
            "gift": 0,
            "papper":1,
            "ribbon":2,
            "pattern":3,
            "description":[
                "你好，圣诞老人，\n我叫杰克逊，今年我多了一个小妹妹！她真的好小！\n妈妈说，圣诞节，大家要相互送礼物，\n我也想要送一个礼物，给小妹妹，\n我想她应该喜欢那种，软乎乎，毛绒绒的东西，\n您可以帮我实现这个愿望吗？",
                "Hello, Santa Claus, \nmy name is Jackson, and this year I got a little sister! She's really tiny! \nMom said that at Christmas, everyone should give gifts to each other, \nand I want to give a gift to my little sister. \nI think she would like something soft and fuzzy. \nCan you help me make this wish come true?"
            ]
        }
    ]
}